rails_app/app/controllers/comments_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1
---
  def create
    @post = Post.find(params[:post_id])