rails_app/app/controllers/posts_controller.rb

SELECT `tags`.* FROM `tags` WHERE (lower(name) = 'rails3')
---
  def index
    @posts = Post.published.order('publish_date DESC').select("title, post.created_at, excerpt, slug, category_id").includes(:category)

    if params[:search]
      @posts = @posts.search "%#{params[:search]}%"
    elsif params[:tag]
      @posts = @posts.tagged_with(params[:tag])
    elsif params[:category]
      @posts = @posts.in_category params[:category]
    end

    @posts.all

SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 31 AND `comments`.`approved` = 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 31 AND `comments`.`approved` = 1 ORDER BY created_at ASC
---
  def show
    post_query = Post.where(:slug => params[:slug])
    post_query = post_query.select("posts.id, slug, title, cached_markdown, categories.id, categories.name, posts.created_at")
    post_query = post_query.joins(:category)
    post_query = post_query.includes(:category)
    @post = post_query.first

    authorize! :read, @post

    raise ActiveRecord::RecordNotFound unless @post

    @comment_count = @post.comments.approved.count
    @comments = @post.comments.approved.all