rails_app/app/controllers/admin/dashboard_controller.rb

  def index
    @posts = Post.admin_table_fields.order('created_at DESC').includes(:category).limit(5)
    @comments = Comment.unscoped.admin_table_fields.order("created_at DESC").limit(10)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` IN (2, 3, 5, 1)
SELECT posts.id, title, published, posts.category_id, slug FROM `posts` ORDER BY created_at DESC LIMIT 5
SELECT comments.id, approved, username, comment FROM `comments` ORDER BY created_at DESC LIMIT 10