rails_app/app/controllers/admin/posts_controller.rb

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` IN (2, 3, 5, 1, 4)
SELECT posts.id, title, published, posts.category_id, slug FROM `posts` ORDER BY created_at DESC LIMIT 25
---
  def index
    @posts = Post.admin_table_fields.includes(:category).order('created_at DESC').limit(25)

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
---
  def update
    @post = Post.find(params[:id])